export enum Role {
	student = "student",
	lecturer = "lecturer",
	admin = "admin",
}

export const roleLabel: Record<Role, string> = {
	student: "Студент",
	lecturer: "Преподаватель",
	admin: "Админ",
};

export enum Gender {
	male = "male",
	female = "female",
}

export const genderLabel: Record<Gender, string> = {
	male: "Мужской",
	female: "Женский",
};

export enum Faculty {
	"ФМиИТ" = "ФМиИТ",
	"ФХБиГН" = "ФХБиГН",
	"ПФ" = "ПФ",
	"ФСПиП" = "ФСПиП",
	"ФФКиС" = "ФФКиС",
	"ФГЗиК" = "ФГЗиК",
	"ХГФ" = "ХГФ",
	"ЮФ" = "ЮФ",
}

export const facultyLabel: Record<Faculty, string> = {
	ФМиИТ: "Математики и информационных технологий",
	ФХБиГН: "Химико-биологических и географических наук",
	ПФ: "Педагогический",
	ФСПиП: "Социальной педагогики и психологии",
	ФФКиС: "Физической культуры и спорта",
	ФГЗиК: "Гуманитарного знания и коммуникаций",
	ХГФ: "Художественно-графический",
	ЮФ: "Юридический",
};

export enum Course {
	first = 1,
	second = 2,
	third = 3,
	fourth = 4,
	fifth = 5,
}

export const courseLabel: Record<Course, string> = {
	1: "Первый",
	2: "Второй",
	3: "Третий",
	4: "Четвёртый",
	5: "Пятый",
};

export enum Group {
	// ПФ
	"25ДО1д" = "25ДО1д",
	"25МО1д" = "25МО1д",
	"25НО1д" = "25НО1д",
	"25СПиИО1д" = "25СПиИО1д",
	"24ДО1д" = "24ДО1д",
	"24МО1д" = "24МО1д",
	"24НО1д" = "24НО1д",
	"24СПиИО1д" = "24СПиИО1д",
	"23ДО1д" = "23ДО1д",
	"23МО1д" = "23МО1д",
	"23НО1д" = "23НО1д",
	"23СПиИО1д" = "23СПиИО1д",
	"22ДО1д" = "22ДО1д",
	"22МИРХ1д" = "22МИРХ1д",
	"22НО1д" = "22НО1д",
	"22ОП1д" = "22ОП1д",
	// ФГЗиК
	"25БФ1д" = "25БФ1д",
	"25ИО1д" = "25ИО1д",
	"25ИО2д" = "25ИО2д",
	"25ИО3д" = "25ИО3д",
	"25РФ1д" = "25РФ1д",
	"25РФ2д" = "25РФ2д",
	"25РФ3д" = "25РФ3д",
	"25ФО1д" = "25ФО1д",
	"25ФО2д" = "25ФО2д",
	"25ФОЗд" = "25ФОЗд",
	"25ФО4д" = "25ФО4д",
	"25РГФ1д" = "25РГФ1д",
	"25РГФ2д" = "25РГФ2д",
	"24БФ1д" = "24БФ1д",
	"24ИО1д" = "24ИО1д",
	"24РФ1д" = "24РФ1д",
	"24ЛОМК1д" = "24ЛОМК1д",
	"24РГФ1д" = "24РГФ1д",
	"24РГФ2д" = "24РГФ2д",
	"23БФ1д" = "23БФ1д",
	"23ИО1д" = "23ИО1д",
	"23ФО1д" = "23ФО1д",
	"23ЛОМК1д" = "23ЛОМК1д",
	"23РГФ1д" = "23РГФ1д",
	"23РГФ2д" = "23РГФ2д",
	"22БФ1д" = "22БФ1д",
	"22ИОД1д" = "22ИОД1д",
	"22РФ1д" = "22РФ1д",
	"22ЛОМК1д" = "22ЛОМК1д",
	"22РГФ1д" = "22РГФ1д",
	"22РГФ2д" = "22РГФ2д",
	"21ЛОМК1д" = "21ЛОМК1д",
	// ФМиИТ
	"25ИСИТ1д" = "25ИСИТ1д",
	"25МИ1д" = "25МИ1д",
	"25МФ1д" = "25МФ1д",
	"25ПИ1д" = "25ПИ1д",
	"25ПИнж1д" = "25ПИнж1д",
	"25ПМ1д" = "25ПМ1д",
	"25УИР1д" = "25УИР1д",
	"24ИСИТ1д" = "24ИСИТ1д",
	"24КБ1д" = "24КБ1д",
	"24МИ1д" = "24МИ1д",
	"24МФ1д" = "24МФ1д",
	"24ПИ1д" = "24ПИ1д",
	"24ПИнж1д" = "24ПИнж1д",
	"24УИР1д" = "24УИР1д",
	"23ИСИТ1д" = "23ИСИТ1д",
	"23ПИ1д" = "23ПИ1д",
	"23ПИнж1д" = "23ПИнж1д",
	"23ПМ1д" = "23ПМ1д",
	"23УИР1д" = "23УИР1д",
	"23ФИЗ1д" = "23ФИЗ1д",
	"23ФМО1д" = "23ФМО1д",
	"22ИСИТ1д" = "22ИСИТ1д",
	"22МИ1д" = "22МИ1д",
	"22ПИ_ВЕБ1д" = "22ПИ_ВЕБ1д",
	"22ПИ_ПОКС1д" = "22ПИ_ПОКС1д",
	"22ПМ1д" = "22ПМ1д",
	"22ПОИТ1д" = "22ПОИТ1д",
	"22УИР1д" = "22УИР1д",
	"22ФИЗ1д" = "22ФИЗ1д",
	// ФСПиП
	"25Пс1д" = "25Пс1д",
	"25СПиПО1д" = "25СПиПО1д",
	"25СПиПО2l" = "25СПиПО2l",
	"24Пс1д" = "24Пс1д",
	"24СПиПО1д" = "24СПиПО1д",
	"24СПиПО2д" = "24СПиПО2д",
	"23Пс1д" = "23Пс1д",
	"23СПиПО1д" = "23СПиПО1д",
	"22Пс1д" = "22Пс1д",
	"22СП1д" = "22СП1д",
	// ФФКиС
	"25ОФК1д" = "25ОФК1д",
	"25ОФК2д" = "25ОФК2д",
	"25ОФК3д" = "25ОФК3д",
	"25ОФК4д" = "25ОФК4д",
	"25ТД1д" = "25ТД1д",
	"24ОФК1д" = "24ОФК1д",
	"24ОФК2д" = "24ОФК2д",
	"24ОФК3д" = "24ОФК3д",
	"24ТД1д" = "24ТД1д",
	"23ОФК1д" = "23ОФК1д",
	"23ОФК2д" = "23ОФК2д",
	"23ОФК3д" = "23ОФК3д",
	"23TД1д" = "23TД1д",
	"22СПД1д" = "22СПД1д",
	"22ФК1д" = "22ФК1д",
	"22ФК2д" = "22ФК2д",
	// ФХБиГН
	"25-Био" = "25-Био",
	"25-БХ1" = "25-БХ1",
	"25-БХ2т" = "25-БХ2т",
	"25-БХ3т" = "25-БХ3т",
	"25-Гео1т" = "25-Гео1т",
	"24-БХ" = "24-БХ",
	"24-МкБ" = "24-МкБ",
	"24-Эко" = "24-Эко",
	"23-БХ" = "23-БХ",
	"23-МкБ" = "23-МкБ",
	"23-Эко" = "23-Эко",
	"22-БХ" = "22-БХ",
	"22-БЭ" = "22-БЭ",
	// ХГФ
	"25Дс1д" = "25Дс1д",
	"25ХОИ3ОТО1д" = "25ХОИ3ОТО1д",
	"25ХОКГ1д" = "25ХОКГ1д",
	"24ДПИ1д" = "24ДПИ1д",
	"24Дс1д" = "24Дс1д",
	"24ХОИЗОТО1д" = "24ХОИЗОТО1д",
	"24ХОКГ1д" = "24ХОКГ1д",
	"23Дс1д" = "23Дс1д",
	"23ХОИЗОКГ1д" = "23ХОИЗОКГ1д",
	"23ХОИ3ОТО1д" = "23ХОИ3ОТО1д",
	"22Дс1д" = "22Дс1д",
	"22ИЗОЧП1д" = "22ИЗОЧП1д",
	"21ДПИд1д" = "21ДПИд1д",
	"21ДПИк1д" = "21ДПИк1д",
	"21Дс1д" = "21Дс1д",
	// ЮФ
	"25Мп1д" = "25Мп1д",
	"25Пр1д" = "25Пр1д",
	"25Пр2д" = "25Пр2д",
	"25Пр3д" = "25Пр3д",
	"24Мп1д" = "24Мп1д",
	"24Пр1д" = "24Пр1д",
	"24Пр2д" = "24Пр2д",
	"24Пр3д" = "24Пр3д",
	"23Мп1д" = "23Мп1д",
	"23Пр1д" = "23Пр1д",
	"23Пр2д" = "23Пр2д",
	"22Мп1д" = "22Мп1д",
	"22Пр1д" = "22Пр1д",
	"22Пр2д" = "22Пр2д",
}

export const groupsByFacultiesAndCourses: Record<
	Faculty,
	Record<Course, Group[]>
> = {
	ФМиИТ: {
		1: [
			Group["25ИСИТ1д"],
			Group["25МИ1д"],
			Group["25МФ1д"],
			Group["25ПИ1д"],
			Group["25ПИнж1д"],
			Group["25ПМ1д"],
			Group["25УИР1д"],
		],
		2: [
			Group["24ИСИТ1д"],
			Group["24КБ1д"],
			Group["24МИ1д"],
			Group["24МФ1д"],
			Group["24ПИ1д"],
			Group["24ПИнж1д"],
			Group["24УИР1д"],
		],
		3: [
			Group["23ИСИТ1д"],
			Group["23ПИ1д"],
			Group["23ПИнж1д"],
			Group["23ПМ1д"],
			Group["23УИР1д"],
			Group["23ФИЗ1д"],
			Group["23ФМО1д"],
		],
		4: [
			Group["22ИСИТ1д"],
			Group["22МИ1д"],
			Group["22ПИ_ВЕБ1д"],
			Group["22ПИ_ПОКС1д"],
			Group["22ПМ1д"],
			Group["22ПОИТ1д"],
			Group["22УИР1д"],
			Group["22ФИЗ1д"],
		],
		5: [],
	},
	ФХБиГН: {
		1: [
			Group["25-Био"],
			Group["25-БХ1"],
			Group["25-БХ2т"],
			Group["25-БХ3т"],
			Group["25-Гео1т"],
		],
		2: [Group["24-БХ"], Group["24-МкБ"], Group["24-Эко"]],
		3: [Group["23-БХ"], Group["23-МкБ"], Group["23-Эко"]],
		4: [Group["22-БХ"], Group["22-БЭ"]],
		5: [],
	},
	ПФ: {
		1: [Group["25ДО1д"], Group["25МО1д"], Group["25НО1д"], Group["25СПиИО1д"]],
		2: [Group["24ДО1д"], Group["24МО1д"], Group["24НО1д"], Group["24СПиИО1д"]],
		3: [Group["23ДО1д"], Group["23МО1д"], Group["23НО1д"], Group["23СПиИО1д"]],
		4: [Group["22ДО1д"], Group["22МИРХ1д"], Group["22НО1д"], Group["22ОП1д"]],
		5: [],
	},
	ФСПиП: {
		1: [Group["25Пс1д"], Group["25СПиПО1д"], Group["25СПиПО2l"]],
		2: [Group["24Пс1д"], Group["24СПиПО1д"], Group["24СПиПО2д"]],
		3: [Group["23Пс1д"], Group["23СПиПО1д"]],
		4: [Group["22Пс1д"], Group["22СП1д"]],
		5: [],
	},
	ФФКиС: {
		1: [
			Group["25ОФК1д"],
			Group["25ОФК2д"],
			Group["25ОФК3д"],
			Group["25ОФК4д"],
			Group["25ТД1д"],
		],
		2: [Group["24ОФК1д"], Group["24ОФК2д"], Group["24ОФК3д"], Group["24ТД1д"]],
		3: [Group["23ОФК1д"], Group["23ОФК2д"], Group["23ОФК3д"], Group["23TД1д"]],
		4: [Group["22СПД1д"], Group["22ФК1д"], Group["22ФК2д"]],
		5: [],
	},
	ФГЗиК: {
		1: [
			Group["25БФ1д"],
			Group["25ИО1д"],
			Group["25ИО2д"],
			Group["25ИО3д"],
			Group["25РФ1д"],
			Group["25РФ2д"],
			Group["25РФ3д"],
			Group["25ФО1д"],
			Group["25ФО2д"],
			Group["25ФОЗд"],
			Group["25ФО4д"],
			Group["25РГФ1д"],
			Group["25РГФ2д"],
		],
		2: [
			Group["24БФ1д"],
			Group["24ИО1д"],
			Group["24РФ1д"],
			Group["24ЛОМК1д"],
			Group["24РГФ1д"],
			Group["24РГФ2д"],
		],
		3: [
			Group["23БФ1д"],
			Group["23ИО1д"],
			Group["23ФО1д"],
			Group["23ЛОМК1д"],
			Group["23РГФ1д"],
			Group["23РГФ2д"],
		],
		4: [
			Group["22БФ1д"],
			Group["22ИОД1д"],
			Group["22РФ1д"],
			Group["22ЛОМК1д"],
			Group["22РГФ1д"],
			Group["22РГФ2д"],
		],
		5: [Group["21ЛОМК1д"]],
	},
	ХГФ: {
		1: [Group["25Дс1д"], Group["25ХОИ3ОТО1д"], Group["25ХОКГ1д"]],
		2: [
			Group["24ДПИ1д"],
			Group["24Дс1д"],
			Group["24ХОИЗОТО1д"],
			Group["24ХОКГ1д"],
		],
		3: [Group["23Дс1д"], Group["23ХОИЗОКГ1д"], Group["23ХОИ3ОТО1д"]],
		4: [Group["22Дс1д"], Group["22ИЗОЧП1д"]],
		5: [Group["21ДПИд1д"], Group["21ДПИк1д"], Group["21Дс1д"]],
	},
	ЮФ: {
		1: [Group["25Мп1д"], Group["25Пр1д"], Group["25Пр2д"], Group["25Пр3д"]],
		2: [Group["24Мп1д"], Group["24Пр1д"], Group["24Пр2д"], Group["24Пр3д"]],
		3: [Group["23Мп1д"], Group["23Пр1д"], Group["23Пр2д"]],
		4: [Group["22Мп1д"], Group["22Пр1д"], Group["22Пр2д"]],
		5: [],
	},
};

export type User = {
	id: number;
	login: string;
	email: string;
	role: Role;
	firstName: string;
	lastName: string;
	middleName: string;
	faculty: Faculty | null;
	course: Course | null;
	group: Group | null;
	avatar: string | null;
	birthDate: string | null;
	gender: Gender | null;
};

export type JwtPayload = {
	id: number;
	login: string;
	email: string;
	role: Role;
	exp: number;
	iat: number;
};

export type UpdateUserRequest = {
	faculty: Faculty | null;
	course: Course | null;
	group: Group | null;
	birthDate: Date | null;
	gender: Gender | null;
};

export type UpdateAvatarResponse = {
	message: string;
}